
story_prompt=[
    "创建一个故事和相应的插图。",
    "生成一个叙述以及匹配的插图。",
    "草拟一篇文章并包括合适的插图。",
    "创作一篇文本，并增加相关的视觉内容。",
    "编写一份报告及其相关视觉内容。",
    "制定一篇文本和适当的插图。",
    "开发一篇文本并整合相关图片。",
    "构建一篇论文及其相关图片。",
    "组装一篇文章及其合适的图片。",
    "构建一个叙述和相应的图形表现。",
    "设计一个故事以及其相关插图。",
]

qa_prompt=[
    "请帮我设计一张图片。",
    "请设计一张图片。",
    "请帮我设计一张海报。",
    "你能给我看这张图片吗？",
    "你能设计这张图片吗？",
    "你能为我的想法创建一个视觉表现吗？",
    "你能帮我为我的项目创建一个视觉效果吗？",
]


ques_prompt=[
    "你看到这张图片中发生了什么？",
    "你认为这张快照中发生了什么？",
    "你能详细说明所提供图片的元素吗？",
    "描述以下图片。",
    "这个场景中发生了什么？",
    "以全面和详细的方式分析这张图片。",
    "写下给定图片的详细描述。",
    "这张照片是关于什么的？",
    "非常详细地解释图片的视觉内容。",
    "这张图片中的关键元素是什么？",
    "你能为我描述这张图片的主要特征吗？",
]

regen_prompt=[
    "生成一张与给定图片含义相同的图片。",
    "生成一张与给定图片类似的图片。",
    "重新创建给定的图片。",
    "生成类似的图片。",
    "你能生成一张类似的图片吗？",
    "制作一张传达与所提供图片相同信息的图片。",
    "创建一张类似于给定的图片。",
    "复制所提供的图片。",
    "生成一张与给定图片有相似之处的图片。",
    "你能给我一张看起来类似的图片吗？",
]

inpaint_prompt=[
    "我想对这张图片进行修复。",
    "修复这张图片。",
    "请在图片中填补空白。",
    "为这张照片填补空白。",
    "为给定的图片进行图像补全。",
    "进行图像修复。",
    "绘制这张图片的缺失部分。",
    "对其进行修复。",
    "完成这张图片。",
    "请修复这张图片。",
]

outpaint_prompt=[
    "扩展这张图片。",
    "扩展这张图片。",
    "对这张图片进行外延。",
    "为这张图片进行图像外延。",
    "创建这个场景的无缝延续，超出其当前边界。",
    "请给我这张图片的外延结果。",
    "你能对这张图片进行外延吗？",
    "完成这张图片。",
    "对这张图片的缺失部分进行外延。",
    "对其进行外延。",
]

textextend_prompt=[
    "生成",
    "生产",
    "给我看",
    "制作一个反映给定概念的视觉表现。",
    "你能画出一个",
    "请设计",
    "将一个场景可视化",
    "你给我展示",
    "你设计一张",
    "创建一张",
    "请帮我生成一张图片。",
    "生成一张图片。",
    "根据给定关键词生成一张图片。",
]

textextend_prompt_behind=[
    "根据给定关键词生成这张图片。",
    "生成这张图片。",
    "生产一张图片。",
    "生成它。",
    "制作一个反映给定概念的视觉表现。",
    "你能画出一幅传达所选关键词的画吗？",
    "请设计一张图片。",
    "根据给定关键词描绘一个场景。",
    "你能给我看这张图片吗？",
    "它长什么样？",
    "我能看看这样的吗？",
    "你能设计这张图片吗？",
]

textextend_prompt2=[
    "请提供详细描述。",
    "进一步扩展这个陈述。",
    "你能进一步扩展这个陈述吗？",
    "详细描述这个句子。",
    "扩展它。",
    "你能详细说明这个句子吗？",
    "详细说明这个句子。",
    "充实这个陈述。",
    "充实它。",
]


